@echo off
title Xiaomi Watchface Store Pro
color 03
mode con: cols=120 lines=30
echo           ,--.                         ,--.                                                                   
echo ,--.  ,--.`--' ,--,--. ,---. ,--,--,--.`--'                                                                   
echo  \  `'  / ,--.' ,-.  ^|^| .-. ^|^|        ^|,--.                                                                   
echo  /  /.  \ ^|  ^|\ '-'  ^|' '-' '^|  ^|  ^|  ^|^|  ^|                                                                   
echo '--'  '--'`--' `--`--' `---' `--`--`--'`--'                                                                   
echo ,--.   ,--.          ,--.        ,--.      ,---.                         
echo ^|  ^|   ^|  ^| ,--,--.,-'  '-. ,---.^|  ,---. /  .-' ,--,--. ,---. ,---.     
echo ^|  ^|.'.^|  ^|' ,-.  ^|'-.  .-'^| .--'^|  .-.  ^|^|  `-,' ,-.  ^|^| .--'^| .-. :    
echo ^|   ,'.   ^|\ '-'  ^|  ^|  ^|  \ `--.^|  ^| ^|  ^|^|  .-'\ '-'  ^|\ `--.\   --.    
echo '--'   '--' `--`--'  `--'   `---'`--' `--'`--'   `--`--' `---' `----'
echo  ,---.   ,--.                                                            
echo '   .-',-'  '-. ,---. ,--.--. ,---.                                      
echo `.  `-.'-.  .-'^| .-. ^|^|  .--'^| .-. :                                     
echo .-'    ^| ^|  ^|  ' '-' '^|  ^|   \   --.                                     
echo `-----'  `--'   `---' `--'    `----'               
echo ,------.                                                                                                      
echo ^|  .--. ',--.--. ,---.                                                                                        
echo ^|  '--' ^|^|  .--'^| .-. ^|                                                                                       
echo ^|  ^| --' ^|  ^|   ' '-' '                                                                                       
echo `--'     `--'    `---'
echo.
echo ─────────────────────────────────────────────────────────────────────────────────────────
echo.
echo 警告：该项目仅用于学习和研究目的，禁止用于商业用途。
echo       获取到的表盘源文件版权归小米所有，最终产生的法律后果将完全由您承担。
echo.
timeout /t 3 /nobreak >nul

start "" /b node server.js
ping -n 5 127.0.0.1 >nul
start "" "http://localhost:3000"
goto MESSAGE_BOX_MAIN
goto WAIT_FOR_KEY

:MESSAGE_BOX_MAIN
cls
color
echo ────────────────────────── Xiaomi Watchface Store Pro V1.0 ──────────────────────────────                                                                                                                       
echo ┌───────────────────────────────────────────────────────────────────────────────────────┐
echo │                                                                                       │
echo │                          Node.js 服务已启动于 localhost:3000                          │
echo │                                                                                       │
echo └───────────────────────────────────────────────────────────────────────────────────────┘
echo.
echo 警告：该项目仅用于学习和研究目的，禁止用于商业用途。
echo       获取到的表盘源文件版权归小米所有，最终产生的法律后果将完全由您承担。
echo.
echo ─────────────────────────────────────────────────────────────────────────────────────────
echo.

:WAIT_FOR_KEY
choice /c E /n /m "按 [E] 键以停止服务"
if errorlevel 1 (
    choice /c YN /n /m "终止批处理操作吗(Y/N)?"
    if errorlevel 1 (
        if errorlevel 2 (
            goto WAIT_FOR_KEY
        )
        cls
        taskkill /f /im node.exe >nul 2>&1
        exit
    )
)
pause